<template>
  <div
    class="bg-light finished-bg d-flex align-items-center"
    style="min-height: 100vh"
  >
    <div
      class="bg-black black-mask bg-opacity-50 d-flex justify-content-center align-items-center"
    >
      <div class="container" style="margin: 6rem auto">
        <div class="row">
          <div
            class="col-md-10 col-lg-8 col-xl-6 offset-md-1 offset-lg-2 offset-xl-3"
          >
            <div class="order-finished-paper paper shadow-lg py-5 p-lg-5">
              <div class="card-head mt-3">
                <div class="px-3">
                  <LogoComp></LogoComp>
                </div>
                <div class="text-center text-light-green mt-4">
                  <div class="sushi-man">
                    <img src="@/assets/images/sushi.png" alt="sushi man" />
                  </div>
                  <h3>既に支払いました</h3>
                </div>
              </div>
              <div class="card-body my-5">
                <article class="lh-lg">
                  <p>
                    大切なお客様 <b>{{ order.user.name }}</b> こんにちは：
                  </p>
                  <p>
                    <b>{{
                      new Date(order.create_at * 1000).toLocaleString("ja-JP")
                    }}</b>
                    にご注文を承りましたので、
                    <b :title="order.user.tel"> 連絡先番号 </b>
                    にご注意ください。
                    <b :title="order.user.email">メールボックス</b
                    >、冷蔵に新鮮な寿司をお届けします
                    <b :title="order.user.address">自宅の住所</b
                    >、私たちの製品を愛してくれてありがとう、私たちはより注意深くよりおいしい寿司を作りますので、お楽しみに。
                  </p>
                  <div class="text-end mt-5">
                    <p class="mb-0">江戸前寿司 － ウィル氏は</p>
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      xmlns:xlink="http://www.w3.org/1999/xlink"
                      x="0px"
                      y="0px"
                      viewBox="0 0 116 66"
                      style="enable-background: new 0 0 116 66"
                      xml:space="preserve"
                      width="100"
                    >
                      <path
                        d="M5.9,65.6c-1.7,0-2.4-0.7-2.7-1.4c-0.8-1.5,0.1-4.1,2.9-8.1c-1.4,0.1-2.9,0.1-4.3,0.2c-0.5,0-1-0.4-1-0.9
	c-0.1-0.5,0.3-1,0.8-1.1c2.2-0.4,4.4-0.7,6.7-1.1c0.4-0.5,0.8-1,1.2-1.6c0.2-0.2,0.3-0.4,0.4-0.5c3.7-4.8,7.5-9.5,11.3-14.1
	c3.5-4.3,7.3-8.5,10.9-12.5c2-2.2,3.9-4.3,5.8-6.6c0.5-0.6,1-1.1,1.3-1.7c0.1-0.4,0.2-0.8,0-1c-0.1-0.2-0.3-0.3-0.5-0.4
	c-0.3-0.1-0.7-0.1-1.3-0.1c-7.2,1.1-14.8,5.6-20,9.2C11.1,28.3,6,33.6,1.9,39.5C1.6,40,1,40.1,0.6,39.8c-0.5-0.3-0.6-0.9-0.3-1.4
	c4.2-6.2,9.5-11.6,15.8-16c7.8-5.4,14.8-8.7,20.9-9.6c0.9-0.1,1.6-0.1,2.3,0.2c0.8,0.3,1.3,0.8,1.6,1.5c0.3,0.8,0.4,1.7,0,2.6
	c-0.4,1-1,1.7-1.6,2.3c-1.9,2.2-3.9,4.4-5.8,6.6c-3.6,4-7.3,8.2-10.8,12.4c-3.7,4.6-7.6,9.3-11.2,14c-0.1,0.1-0.2,0.2-0.3,0.3
	c5-0.8,10.1-1.7,15.2-2.5c1.9-1.2,3.9-2.4,5.8-3.5c1.8-1.1,3.7-2.1,5.5-3.3c0.4-0.3,0.9-0.2,1.3,0.2c0.3,0.4,0.4,0.9,0.1,1.3
	c-0.6,0.8-1.3,2.1-1.9,3.5c1.3-0.2,2.6-0.4,3.9-0.6c1.3-1.4,2.5-3,3.4-4.5c0.1-0.1,0.1-0.2,0.2-0.3c0.3-0.5,0.9-0.6,1.4-0.3
	c0.5,0.3,0.6,0.9,0.3,1.4c0,0.1-0.1,0.2-0.1,0.2c-0.4,0.7-0.7,1.7-0.9,2.7c2.4-0.4,4.9-0.8,7.3-1.2c0-0.1,0-0.2,0-0.3
	c-0.1-2,0.6-4.1,1.9-5.4c1.1-1.1,2.5-1.6,4-1.6c0.3,0,0.5,0.1,0.7,0.3c0.2,0.2,0.3,0.5,0.3,0.7c-0.1,2-1.1,3.9-2.3,5.5
	c1.4-0.2,2.8-0.5,4.2-0.7c0,0,0.1-0.1,0.1-0.1c2.2-1.5,3.9-3.6,5.6-5.6c0.3-0.4,0.9-0.5,1.3-0.2c0.4,0.3,0.6,0.8,0.4,1.3
	c-0.2,0.5-0.1,2.2,0,3.2c0,0,0,0,0,0c2.4-0.3,4.9-2.3,7.4-5.7c0.3-0.4,0.8-0.5,1.2-0.3c0.4,0.2,0.7,0.6,0.6,1.1
	c0,0.2,0.4,0.6,1.2,0.7c0.7,0.2,1.4,0.2,2.2,0.1c0.8-1.9,1.8-3.8,2.8-5.7l0.9-1.8C88.3,24.7,91.7,18,96.1,12l0.2-0.2
	c3.3-4.5,8.8-11.9,15.2-11.3c0.9,0.1,1.6,0.3,2.2,0.7c0.6,0.4,1,1,1.4,1.8c2.3,4.6-0.4,8.3-2.8,11.7l-0.3,0.4
	c-5.8,8-11.3,13.8-18,18.7c-0.6,0.5-1.3,1-2,1.5c-2.7,2.1-5.9,4.7-9.3,5.5c0,0.1-0.1,0.2-0.1,0.3c6.7-1.1,13.4-2.2,20-3.3
	c0.4-0.1,0.7-0.1,1.1-0.2c0.5-0.1,1.1,0.3,1.1,0.8s-0.3,1.1-0.8,1.1c-0.4,0.1-0.7,0.1-1.1,0.2c-6.3,1.2-11.8,4.3-16,9.2
	c8.5-0.5,17.5-0.8,27.4-1c0,0,0,0,0,0c0.5,0,1,0.4,1,1c0,0.6-0.4,1-1,1c-10.6,0.2-20.1,0.6-29.1,1.1c-0.2,0.3-0.4,0.6-0.7,0.9
	c-1.4,2.1-2.9,4.2-5.3,5.1c-0.1,0.1-0.6,0.2-1.1,0c-0.5-0.2-0.7-0.7-0.7-0.9c-0.5-1.5-0.5-3.1-0.3-4.7c-8.3,0.5-16.4,1.2-24.6,1.8
	c-5.6,0.4-11.3,0.9-17.1,1.3c-0.2,0.1-0.4,0.2-0.6,0.2c-0.3,0.1-0.6,0-0.8-0.1c-3.8,0.3-7.7,0.5-11.7,0.8c-1.3,0.9-2.7,1.9-3.9,2.8
	c-3,2.2-6.1,4.4-9.3,6.4C8.1,65.1,7.1,65.6,5.9,65.6C5.9,65.6,5.9,65.6,5.9,65.6z M8.6,56c-3.9,5.4-3.8,7-3.6,7.3
	c0.1,0.2,0.7,0.3,0.9,0.3c0.6,0,1.3-0.4,2-0.8c3.2-2,6.2-4.2,9.2-6.3c0.4-0.3,0.9-0.6,1.3-1C15.2,55.7,12,55.9,8.6,56z M79.1,51.2
	c-0.2,1.2-0.3,2.4,0,3.6c1.4-0.8,2.5-2.2,3.6-3.8C81.5,51,80.3,51.1,79.1,51.2z M22.2,52.9c-1.2,0.2-2.4,0.4-3.6,0.6
	c1-0.1,2-0.1,3-0.2C21.7,53.2,22,53.1,22.2,52.9z M27,52.1c-0.5,0.3-1,0.7-1.5,1c2.8-0.2,5.5-0.4,8.1-0.6c0.1-0.5,0.2-1,0.4-1.6
	C31.7,51.3,29.4,51.7,27,52.1z M41.9,49.6c-0.8,0.9-1.7,1.7-2.7,2.5c1.9-0.1,3.9-0.3,5.8-0.4c0,0-0.1,0-0.1,0
	c-0.5-0.2-1.2-0.7-1.6-1.8c0-0.1-0.1-0.2-0.1-0.4C42.8,49.5,42.4,49.6,41.9,49.6z M36.2,50.6c-0.2,0.5-0.3,1-0.4,1.4
	c0.9-0.5,1.8-1.1,2.6-1.8C37.7,50.3,37,50.5,36.2,50.6z M54.3,48.1c-1.2,1.1-2.2,1.8-2.6,2.1c-0.6,0.4-1.2,0.8-1.9,1.1
	c0.8-0.1,1.7-0.1,2.5-0.2c8.4-0.7,16.6-1.3,25.1-1.9c0.4-1.4,0.8-2.8,1.3-4c0.1-0.4,0.3-0.8,0.4-1.1c0.1-0.2,0.1-0.4,0.2-0.6
	c-5.8,1-11.6,1.9-17.3,2.9c-2.2,1.3-4.4,2-6.7,1.9C55.1,48.3,54.7,48.2,54.3,48.1z M45.2,49.1c0,0,0,0.1,0,0.1
	c0.1,0.3,0.2,0.5,0.4,0.6c1.7,0.7,3.8-0.5,4.9-1.2c0.2-0.1,0.4-0.3,0.7-0.5C49.2,48.4,47.2,48.8,45.2,49.1z M35.5,47.1
	c-0.8,0.5-1.6,0.9-2.3,1.4c-0.5,0.3-1,0.6-1.5,0.9c1-0.2,2.1-0.3,3.1-0.5C35,48.2,35.2,47.6,35.5,47.1z M81.7,43.1
	c-0.2,0.5-0.4,1.1-0.6,1.7c-0.1,0.4-0.3,0.8-0.4,1.2c-0.4,1-0.7,2.1-1.1,3.2c1.5-0.1,3-0.2,4.6-0.3c2.4-3.1,5.2-5.7,8.5-7.6
	C89,41.9,85.3,42.5,81.7,43.1z M57.2,40.7c-0.5,0.2-1,0.4-1.4,0.8c-0.9,0.9-1.4,2.3-1.4,3.6C55.8,43.8,56.8,42.2,57.2,40.7z
	 M66.7,42.3c-0.5,0.5-0.9,1-1.4,1.5c0.5-0.1,1-0.2,1.6-0.3c0-0.1,0-0.2,0-0.4C66.8,42.9,66.8,42.6,66.7,42.3z M76.8,39.7
	c-0.8,1-1.6,1.9-2.4,2.6c1.9-0.3,3.9-0.6,5.8-1c0.1-0.1,0.1-0.3,0.2-0.4c-0.6,0-1.2-0.1-1.8-0.2C77.9,40.5,77.3,40.1,76.8,39.7z
	 M110.8,2.4c-5.1,0-10,6.6-12.9,10.5l-0.2,0.2c-4.3,5.9-7.7,12.6-11,19L85.8,34c-0.7,1.4-1.4,2.8-2,4.1c2.4-1,4.8-2.9,6.9-4.6
	c0.7-0.6,1.4-1.1,2.1-1.6c6.5-4.8,11.9-10.4,17.5-18.2l0.3-0.4c2.3-3.1,4.4-6.1,2.7-9.6c-0.2-0.5-0.5-0.8-0.8-1
	c-0.3-0.2-0.7-0.3-1.2-0.4C111.1,2.4,111,2.4,110.8,2.4z"
                      />
                    </svg>
                  </div>
                </article>
              </div>
              <div class="card-footer">
                <div class="text-center">
                  <router-link to="/myOrders" class="btn btn-dark">
                    確認後、注文に戻る
                  </router-link>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import LogoComp from "@/components/logo/LogoComp";

export default {
  data() {
    return {
      order: {
        user: {},
      },
      orderId: this.$route.params,
    };
  },
  components: {
    LogoComp,
  },
  methods: {
    // 取得訂單
    getOrder() {
      let loader = this.$loading.show();

      this.$http
        .get(
          `${process.env.VUE_APP_API}/api/${process.env.VUE_APP_PATH}/order/${this.orderId.id}`
        )
        .then((res) => {
          loader.hide();
          this.order = res.data.order;
        })
        .catch((err) => {
          loader.hide();
          alert(err.response.data.message);
        });
    },
  },
  mounted() {
    this.getOrder();
  },
};
</script>

<style lang="scss">
.finished-bg {
  background: var(--bs-dark)
    url("https://storage.googleapis.com/vue-course-api.appspot.com/letcla/1649230939689.jpg?GoogleAccessId=firebase-adminsdk-zzty7%40vue-course-api.iam.gserviceaccount.com&Expires=1742169600&Signature=kxfKl0Z19FBLgCpCCKsg%2BpkbUcty%2FnVX7suwQTY6kiF1gG2sDjAmkgF60OmdgFBbZelQSIj6fCjUr8l565dBYPA%2FOeqcdpuqCAp8rc%2F5aX68d5zOKhxVcZvlf3HM2HUR1sSJXu%2BLLSaxZAQ78lD0XxxyxK4Mt4XybALm7ciW4KeUTcT%2Foic4fRcddk2AdEq58Pncl9Ho5aPnDOyOqb7O0jt5nlAuGbAbdtU5xY1L3wJ8vMyml02xssi6hPjBAflg%2BkhcyFIxzl03%2BNg%2B7Hu8JIYK2Kx6ZSAEXtxl3El3ZJk4%2BLwetO8%2BRhug5GmWXKsCL6b%2FNEzwtFa80NFSSzcFVQ%3D%3D")
    50% 50% no-repeat;
  background-size: cover;
}
.black-mask {
  width: 100%;
  min-height: 100vh;
}
.order-finished-paper {
  position: relative;
  border: 4px solid indianred;
  .sushi-man {
    img {
      width: 80px;
    }
  }
}
</style>
